{
  "backend/main.mo": "Defines the main actor with authorization mixin, domain types, and ID counters for clinics, patients, treatments, cases, and feedback.",
  "backend/migration.mo": "Contains type definitions and migration structures for upgrading stored actor state, including removal of the validatedUsers field.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the behavior and purpose of major frontend files including pages, hooks, utilities, and components.",
  "frontend/index.css": "Defines global Tailwind layers and OKLCH color variables for light and dark themes, applying them to base elements.",
  "frontend/index.html": "Minimal HTML template that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up routing and application bootstrap with actor initialization, timeout recovery, and direct rendering of the AppShell without auth gating.",
  "frontend/src/components/auth/AccessCodeGate.tsx": "Empty file placeholder for the removed access-code gate component.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Empty file placeholder for the removed profile setup modal.",
  "frontend/src/components/bootstrap/BootstrapRecoveryScreen.tsx": "Error recovery UI showing an error message, optional technical details, and actions to retry, reset session, or reload.",
  "frontend/src/components/bootstrap/RouterRecoveryBoundary.tsx": "Wraps routes with an error boundary that clears caches and displays the BootstrapRecoveryScreen on failure.",
  "frontend/src/components/branding/AppLogo.tsx": "Renders the app logo image in square or wide variants.",
  "frontend/src/components/dashboard/RightSidebar.tsx": "Sidebar showing follow-up reminders, hygiene due patients, and related patient/treatment info.",
  "frontend/src/components/dashboard/TreatmentModals.tsx": "Modal forms for adding or editing treatments with validation and backend mutation hooks.",
  "frontend/src/components/dashboard/TreatmentQuickActions.tsx": "Provides quick actions for treatments including status updates, scheduling follow‑ups, and progress updates.",
  "frontend/src/components/shell/AppShell.tsx": "Main layout with sidebar, mobile navigation, and routed content area.",
  "frontend/src/components/shell/MobileHeader.tsx": "Mobile header with menu toggle and compact logo display.",
  "frontend/src/components/shell/Sidebar.tsx": "Sidebar navigation with menu items, app branding, and a session reset action.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useBootstrapTimeout.ts": "Provides a timeout state when loading exceeds a specified duration to prevent indefinite spinners.",
  "frontend/src/hooks/useDashboardAccess.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useHygieneDuePatients.ts": "Computes patients overdue for hygiene visits by comparing last cleaning dates with a six‑month threshold.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, stored identity loading, and status management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on clinics, patients, treatments, cases, feedback, and analytics using the backend actor.",
  "frontend/src/hooks/useSessionAuth.ts": "Empty placeholder hook file.",
  "frontend/src/index.css": "Tailwind CSS setup with custom CSS variables for themes, colors, and layout tokens.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/AlignerTrackingPage.tsx": "UI page for managing aligner cases including listing, filtering, progress display, and CRUD modal interactions.",
  "frontend/src/pages/auth/LoginPage.tsx": "Empty login page placeholder.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard displaying patients and treatments with filtering, KPIs, pagination, and modals for managing treatment actions.",
  "frontend/src/pages/ImplantTrackingPage.tsx": "Tracks implant cases with stage filtering, search, and CRUD modals for adding, editing, and deleting implant records.",
  "frontend/src/pages/PatientFeedbackPage.tsx": "Manages patient feedback with rating filters, search, stats, and modals for adding or editing feedback entries.",
  "frontend/src/pages/PatientsPage.tsx": "Handles patient list, hygiene-due filtering, search, and full CRUD operations with validation and WhatsApp links.",
  "frontend/src/pages/SettingsPage.tsx": "Provides settings for managing clinics plus templates for WhatsApp and review links, with modal-based clinic CRUD.",
  "frontend/src/pages/ZonalAnalyticsPage.tsx": "Displays zonal analytics by aggregating clinics, patients, and treatments and visualizing stats like monthly trends, status distribution, and top doctors.",
  "frontend/src/utils/actorError.ts": "Maps backend and bootstrap errors to readable messages and extracts technical details for debugging.",
  "frontend/src/utils/analytics.ts": "Provides utilities for grouping treatments, formatting dates, calculating distributions, ranking doctors, and computing remaining work.",
  "frontend/src/utils/bootstrapReset.ts": "Clears React Query caches and session keys to fully reset bootstrap state.",
  "frontend/src/utils/bootstrapSanityCheck.ts": "Analyzes errors to detect misconfigured or unreachable backend canisters and returns user-friendly diagnostics.",
  "frontend/src/utils/treatmentProgress.ts": "Handles tooth number parsing, formatting, and treatment progress calculations and validation.",
  "frontend/src/utils/urlParams.ts": "Manages URL and sessionStorage parameters, including parsing, persistence, and cleanup.",
  "frontend/src/utils/validation.ts": "Implements basic validation helpers for email and required fields.",
  "frontend/src/utils/whatsapp.ts": "Generates WhatsApp message links from phone numbers and optional text.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom OKLCH color system, extended theme settings, and animation keyframes with typography, container queries, and animate plugins.",
  "project_state.json": "Project state describing the removal of all authentication and access-code gating, listing related features, known issues, and pending requests for fully anonymous app access."
}